{"totalErrors":["50 students could not register Principles of Embedded System Design because of semester inconsistency!","41 students could not register Principles of Programming Languages because of semester inconsistency!","52 students could not register Engineering Project 1 because of semester inconsistency!","32 students could not register Turkish Language 2 because of semester inconsistency!","32 students could not register Numerical Methods because of semester inconsistency!","45 students could not register Engineering Economy because of semester inconsistency!","48 students could not register Software Engineering because of semester inconsistency!","49 students could not register Non Technical Elective 2 because of semester inconsistency!","46 students could not register Faculty Technical Elective because of semester inconsistency!","64 students could not register Technical Elective 2 because of semester inconsistency!","34 students could not register Physics 1 because of semester inconsistency!","52 students could not register Technical Elective 3 because of semester inconsistency!","35 students could not register Physics 2 because of semester inconsistency!","45 students could not register Work Safety 1 because of semester inconsistency!","56 students could not register Operating Systems because of semester inconsistency!","42 students could not register Differential Equations because of semester inconsistency!","53 students could not register Introduction to Machine Learning because of semester inconsistency!","45 students could not register Modeling and Discrete Simulation because of semester inconsistency!","29 students could not register Analysis of Algorithms because of semester inconsistency!","26 students could not register Ataturk's Principles and History 1 because of semester inconsistency!","41 students could not register Computer Programming 2 because of semester inconsistency!","57 students could not register University Elective because of semester inconsistency!","46 students could not register Systems Programming because of semester inconsistency!","51 students could not register Work Safety 2 because of semester inconsistency!","41 students could not register Electronics because of semester inconsistency!","47 students could not register Discrete Computational Structures because of semester inconsistency!","35 students could not register Non Technical Elective 1 because of semester inconsistency!","36 students could not register Calculus 1 because of semester inconsistency!","65 students could not register Formal Language and Automata Theory because of semester inconsistency!","38 students could not register Operations Research because of semester inconsistency!","33 students could not register Turkish Language 1 because of semester inconsistency!","44 students could not register Technical Communication and Entrepreneurship because of semester inconsistency!","38 students could not register Technical Elective 1 because of semester inconsistency!","59 students could not register Digital Logic Design because of semester inconsistency!","31 students could not register Probability and Statistics for Computer Engineers because of semester inconsistency!","47 students could not register Introduction to Signals and Systems because of semester inconsistency!","44 students could not register Linear Algebra for Computer Engineers because of semester inconsistency!","35 students could not register Electric Circuits because of semester inconsistency!","51 students could not register Engineering Project 2 because of semester inconsistency!","33 students could not register Ataturk's Principles and History 2 because of semester inconsistency!","39 students could not register Calculus 2 because of semester inconsistency!","40 students could not register Computer Networks because of semester inconsistency!","50 students could not register Object Oriented Software Design because of semester inconsistency!","56 students could not register Computer Organization because of semester inconsistency!","38 students could not register Database Systems because of semester inconsistency!","31 students could not register Physics Lab 2 because of semester inconsistency!","48 students could not register Technical Elective 4 because of semester inconsistency!","37 students could not register Data Structures because of semester inconsistency!","32 students could not register Computer Programming 1 because of semester inconsistency!","24 students could not register Introduction to Modern Biology because of semester inconsistency!","32 students could not register Physics Lab 1 because of semester inconsistency!","34 students could not register Introduction to Computer Engineering because of semester inconsistency!","49 students could not register Principles of Embedded System Design because of did not meet the prerequisite!","37 students could not register Principles of Programming Languages because of did not meet the prerequisite!","39 students could not register Numerical Methods because of did not meet the prerequisite!","47 students could not register Software Engineering because of did not meet the prerequisite!","48 students could not register Operating Systems because of did not meet the prerequisite!","47 students could not register Introduction to Machine Learning because of did not meet the prerequisite!","40 students could not register Modeling and Discrete Simulation because of did not meet the prerequisite!","29 students could not register Analysis of Algorithms because of did not meet the prerequisite!","52 students could not register Electronics because of did not meet the prerequisite!","36 students could not register Object Oriented Software Design because of did not meet the prerequisite!","54 students could not register Formal Language and Automata Theory because of did not meet the prerequisite!","22 students could not register Operations Research because of did not meet the prerequisite!","36 students could not register Introduction to Signals and Systems because of did not meet the prerequisite!","38 students could not register Electric Circuits because of did not meet the prerequisite!","50 students could not register Engineering Project 2 because of did not meet the prerequisite!","47 students could not register Computer Organization because of did not meet the prerequisite!","38 students could not register Database Systems because of did not meet the prerequisite!","33 students could not register Data Structures because of did not meet the prerequisite!","29 students could not register Principles of Programming Languages because of course collision!","8 students could not register Technical Elective 2 because of course collision!","17 students could not register Analysis of Algorithms because of course collision!","24 students could not register Operating Systems because of course collision!","17 students could not register Electronics because of course collision!","3 students could not register Principles of Embedded System Design because of course collision!","6 students could not register Differential Equations because of course collision!","33 students could not register Digital Logic Design because of course collision!","5 students could not register Database Systems because of course collision!","15 students could not register Computer Programming 1 because of course collision!","9 students could not register Object Oriented Software Design because of course collision!","9 students could not register Physics Lab 2 because of course collision!","4 students could not register Computer Programming 2 because of course collision!","7 students could not register Technical Elective 4 because of course collision!","6 students could not register Computer Organization because of course collision!","4 students could not register Physics 2 because of course collision!","7 students could not register University Elective because of course collision!","3 students could not register Formal Language and Automata Theory because of course collision!","7 students could not register Introduction to Modern Biology because of course collision!","8 students could not register Introduction to Machine Learning because of course collision!","6 students could not register Introduction to Signals and Systems because of course collision!","6 students could not register Probability and Statistics for Computer Engineers because of course collision!","4 students could not register Faculty Technical Elective because of course collision!","1 students could not register Ataturk's Principles and History 1 because of course collision!","29 students could not register Systems Programming because of course collision!","4 students could not register Data Structures because of course collision!","11 students could not register Calculus 1 because of course collision!","13 students could not register Modeling and Discrete Simulation because of course collision!","3 students could not register Operations Research because of course collision!","7 students could not register Engineering Economy because of course collision!","1 students could not register Numerical Methods because of course collision!","3 students could not register Turkish Language 2 because of course collision!","4 students could not register Non Technical Elective 2 because of course collision!","5 students could not register Physics 1 because of course collision!","2 students could not register Linear Algebra for Computer Engineers because of course collision!","2 students could not register Computer Networks because of course collision!","2 students could not register Technical Elective 1 because of course collision!","1 students could not register Software Engineering because of course collision!"]}