{"totalErrors":["2 students could not register Work Safety 1 because of semester inconsistency!","3 students could not register Calculus 1 because of semester inconsistency!","2 students could not register Electronics because of semester inconsistency!","2 students could not register Computer Organization because of semester inconsistency!","1 students could not register Numerical Methods because of semester inconsistency!","3 students could not register Ataturk's Principles and History 1 because of semester inconsistency!","2 students could not register Introduction to Computer Engineering because of semester inconsistency!","2 students could not register Electric Circuits because of semester inconsistency!","1 students could not register Database Systems because of semester inconsistency!","3 students could not register Engineering Project 2 because of semester inconsistency!","1 students could not register Physics 2 because of semester inconsistency!","1 students could not register Technical Elective 4 because of semester inconsistency!","2 students could not register Engineering Economy because of semester inconsistency!","1 students could not register Differential Equations because of semester inconsistency!","1 students could not register Work Safety 2 because of semester inconsistency!","1 students could not register Modeling and Discrete Simulation because of semester inconsistency!","2 students could not register Technical Elective 1 because of semester inconsistency!","3 students could not register Data Structures because of semester inconsistency!","2 students could not register Operating Systems because of semester inconsistency!","1 students could not register Physics Lab 1 because of semester inconsistency!","1 students could not register Analysis of Algorithms because of semester inconsistency!","1 students could not register Software Engineering because of semester inconsistency!","1 students could not register Computer Networks because of semester inconsistency!","1 students could not register Principles of Embedded System Design because of semester inconsistency!","1 students could not register Calculus 2 because of semester inconsistency!","1 students could not register Introduction to Machine Learning because of semester inconsistency!","1 students could not register Linear Algebra for Computer Engineers because of semester inconsistency!","1 students could not register Digital Logic Design because of semester inconsistency!","4 students could not register Data Structures because of did not meet the prerequisite!","2 students could not register Electronics because of did not meet the prerequisite!","1 students could not register Numerical Methods because of did not meet the prerequisite!","1 students could not register Database Systems because of did not meet the prerequisite!","3 students could not register Engineering Project 2 because of did not meet the prerequisite!","1 students could not register Computer Organization because of did not meet the prerequisite!","1 students could not register Modeling and Discrete Simulation because of did not meet the prerequisite!","2 students could not register Operating Systems because of did not meet the prerequisite!","1 students could not register Analysis of Algorithms because of did not meet the prerequisite!","1 students could not register Software Engineering because of did not meet the prerequisite!","1 students could not register Principles of Embedded System Design because of did not meet the prerequisite!","1 students could not register Introduction to Machine Learning because of did not meet the prerequisite!","1 students could not register Calculus 2 because of course collision!","1 students could not register Computer Organization because of course collision!","1 students could not register Data Structures because of course collision!","2 students could not register Analysis of Algorithms because of course collision!"]}